modm-ext/data.modm.io/docs/svd/header_stm32h7r3xx.svd
        <register>
          <name>OBKCR</name>
          <description>FLASH option byte key control register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OBKINDEX</name>
              <description>Option byte key index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NEXTKL</name>
              <description>Next key level</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OBKSIZE</name>
              <description>Option byte key size</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>KEYPROG</name>
              <description>Key program</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>KEYSTART</name>
              <description>Key option start</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBKDR0</name>
          <description>FLASH option bytes key data register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OBKDATA</name>
              <description>Option byte key data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBKDR1</name>
          <description>FLASH option bytes key data register</description>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OBKDATA</name>
              <description>Option byte key data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBKDR2</name>
          <description>FLASH option bytes key data register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OBKDATA</name>
              <description>Option byte key data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBKDR3</name>
          <description>FLASH option bytes key data register</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OBKDATA</name>
              <description>Option byte key data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBKDR4</name>
          <description>FLASH option bytes key data register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OBKDATA</name>
              <description>Option byte key data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBKDR5</name>
          <description>FLASH option bytes key data register</description>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OBKDATA</name>
              <description>Option byte key data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBKDR6</name>
          <description>FLASH option bytes key data register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OBKDATA</name>
              <description>Option byte key data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBKDR7</name>
          <description>FLASH option bytes key data register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OBKDATA</name>
              <description>Option byte key data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVSR</name>
          <description>FLASH non-volatile status register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NVSTATE</name>
              <description>Non-volatile state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVSRP</name>
          <description>FLASH security status register programming</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NVSTATE</name>
              <description>Non-volatile state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ROTSR</name>
          <description>FLASH RoT status register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OEM_PROVD</name>
              <description>OEM provisioned state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DBG_AUTH</name>
              <description>Debug authentication method</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IROT_SELECT</name>
              <description>iRoT selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ROTSRP</name>
          <description>FLASH RoT status register programming</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OEM_PROVD</name>
              <description>OEM provisioned state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DBG_AUTH</name>
              <description>Debug authentication method</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IROT_SELECT</name>
              <description>iRoT selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPLSR</name>
          <description>FLASH OTP lock status register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OTPL</name>
              <description>OTP lock n (n=0 to 15)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPLSRP</name>
          <description>FLASH OTP lock status programming register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OTPL</name>
              <description>OTP lock n (n=0 to 15)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPSR</name>
          <description>FLASH write protection status register</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WRPS</name>
              <description>Write protection for sector n (n=0 to 7)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPSRP</name>
          <description>FLASH write protection status register programming</description>
          <addressOffset>0x21c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WRPS</name>
              <description>Write protection for sector n (n=0 to 7)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HDPSR</name>
          <description>FLASH hide protection status register</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HDP_AREA_START</name>
              <description>Hide protection user flash area start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HDP_AREA_END</name>
              <description>Hide protection user flash area end</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HDPSRP</name>
          <description>FLASH hide protection status register programming</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HDP_AREA_START</name>
              <description>Hide protection user flash area start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HDP_AREA_END</name>
              <description>Hide protection user flash area end</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EPOCHSR</name>
          <description>FLASH epoch status register</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EPOCH</name>
              <description>Epoch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EPOCHSRP</name>
          <description>FLASH epoch status register programming</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EPOCH</name>
              <description>Epoch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBW1SR</name>
          <description>FLASH option byte word 1 status register</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOR_LEVEL</name>
              <description>Brownout level</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IWDG_HW</name>
              <description>Independent watchdog HW control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STOP</name>
              <description>Reset on stop mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STBY</name>
              <description>Reset on standby mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI1_HSLV</name>
              <description>XSPI1 High-speed at low voltage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI2_HSLV</name>
              <description>XSPI2 High-speed at low voltage</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_STOP</name>
              <description>IWDG Stop mode freeze</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_STBY</name>
              <description>IWDG Standby mode freeze</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERSO_OK</name>
              <description>Personnalization OK</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO_HSLV</name>
              <description>I/O High-speed at low voltage</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBW1SRP</name>
          <description>FLASH option byte word 1 status register programming</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOR_LEVEL</name>
              <description>Brownout level</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IWDG_HW</name>
              <description>Independent watchdog HW control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STOP</name>
              <description>Reset on stop mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRST_STBY</name>
              <description>Reset on standby mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI1_HSLV</name>
              <description>XSPI1 High-speed at low voltage</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI2_HSLV</name>
              <description>XSPI2 High-speed at low voltage</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_STOP</name>
              <description>IWDG Stop mode freeze</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDG_FZ_STBY</name>
              <description>IWDG Standby mode freeze</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO_HSLV</name>
              <description>I/O High-speed at low voltage</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBW2SR</name>
          <description>FLASH option byte word 2 status register</description>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ITCM_AXI_SHARE</name>
              <description>ITCM AXI share</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DTCM_AXI_SHARE</name>
              <description>DTCM AXI share</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ECC_ON_SRAM</name>
              <description>ECC on SRAM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_NI3C</name>
              <description>I2C Not I3C</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OBW2SRP</name>
          <description>FLASH option byte word 2 status register programming</description>
          <addressOffset>0x26c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ITCM_AXI_SHARE</name>
              <description>ITCM AXI share</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DTCM_AXI_SHARE</name>
              <description>DTCM AXI share</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ECC_ON_SRAM</name>
              <description>ECC on SRAM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_NI3C</name>
              <description>I2C Not I3C</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
